In [1]:
import pandas as pd
import numpy as np
import json
import sys
import csv

# List of command statements on this page

import pandas as pd
import json as js

db = pd.read_csv('All_data_files\\exe1.csv')

db.to_csv('All_data_files\\omkara.csv', sep=';')
k = pd.read_csv('All_data_files\\omkara.csv', sep=';')
k

db.to_csv('All_data_files\\omkara.csv', sep=';', index=False, header=False)
k = pd.read_csv('All_data_files\\omkara.csv', sep=';')
k

db.to_csv('All_data_files\\omkara1.csv',sep='/', index=False, columns=['a','message'])
k = pd.read_csv('All_data_files\\omkara1.csv', sep='/')
k

-----------------JSON---------------------
Example-1

obj = """{
"name":"Wes",
"places_lived":["USA", "Spain", "Germany"],
"pet":null,
"siblings":[{"name":"Scott", "age":30, "pets":["Zeus","Zuko"]},
            {"name":"Katie", "age":38,
            "pets":["Sixes", "Stache", "Cisco"]}]
}"""
result = js.loads(obj)

result
result['siblings']

json_part = pd.DataFrame(result['siblings'])
json_part

json_part = pd.DataFrame(result['siblings'], columns=['name', 'pets'])
json_part

Example-2
strJson = """{
	"id": "0001",
	"type": "donut",
	"name": "Cake",
	"ppu": 0.55,
	"batters":
		{
			"batter":
				[
					{ "id": "1001", "type": "Regular" },
					{ "id": "1002", "type": "Chocolate" },
					{ "id": "1003", "type": "Blueberry" },
					{ "id": "1004", "type": "Devil's Food" }
				]
		},
	"topping":
		[
			{ "id": "5001", "type": "None" },
			{ "id": "5002", "type": "Glazed" },
			{ "id": "5005", "type": "Sugar" },
			{ "id": "5007", "type": "Powdered Sugar" },
			{ "id": "5006", "type": "Chocolate with Sprinkles" },
			{ "id": "5003", "type": "Chocolate" },
			{ "id": "5004", "type": "Maple" }
		]
}"""

json_object = js.loads(strJson)
json_object

print(type(json_object))
- <type 'dict'> 
str1 = js.dumps(json_object)
print(type(str1))
- <type 'str'>

#Calling data from example.json file
json_data = pd.read_json('All_data_files\\example.json')
json_data

#By default System returns, there is no file name given
json_data.to_json()  

#By default System returns, there is no file name given
json_data.to_json(orient="records")

json_data.to_json('All_data_files\\gct.json', orient="records")

bankDF = pd.read_csv("All_data_files\\bank-additional-full.csv", sep=';', nrows=50,)
bankDF.columns

bankDF.to_csv('All_data_files\\new_bank_data.csv', sep=',', index=None, columns=['age', 'job', 'marital', 'education'] )

bankDF1= pd.read_csv('All_data_files\\new_bank_data.csv')
bankDF1

--------------------------------------------------------
ChunkSize=10000 operation on read_csv() function¶
--------------------------------------------------------

db = pd.read_csv('All_data_files\\bank-additional-full.csv', sep=';', chunksize=2)

db.get_chunk(10)

db = pd.read_csv('All_data_files\\exe1.csv')
db

db.to_csv(sys.stdout, na_rep='NULL')
db


------------------------------------------------------
Reading CSV file without Pandas Functions
------------------------------------------------------

import csv

f = open('All_data_files\\exe1.csv','r')
read_csv = csv.reader(f)
print(f)
print(read_csv)
for line in read_csv:
    print line

#######Another way using csv library#######

with open('All_data_files\\exe1.csv') as ct:
    newLst = list(csv.reader(ct))
newLst

lst1, lst2, lst3 = newLst[0], newLst[0:2], newLst[1:]
print(lst1)
print(lst2)
print(lst3)

----------------------------------------------------
Binary file format 
----------------------------------------------------

-------------writing pickle binary data-------------
db = pd.read_csv('All_data_files\\exe1.csv')
db
db.to_pickle("All_data_files\\Pickle_from_csv")

data = pd.read_pickle('All_data_files\\Pickle_from_csv')
data

--------writing json data to pickle file------------
json_data = pd.read_json('All_data_files\\example.json')
json_data
json_data.to_pickle("All_data_files\\Pickle_from_json")

db = pd.read_pickle("All_data_files\\Pickle_from_json")
db

pwd()

-----------writing (.h5) binary file----------------

frame1 = pd.DataFrame({'a': np.random.randn(10)})
frame1

frame2 = pd.DataFrame({'b': np.random.randn(5)})
frame2


store = pd.HDFStore("All_data_files\\Binary_h5_format.h5")
store['ct'] = frame1
store['kt'] = frame2

store
store['ct']
store['kt']

# CSV, TSV, Excel, html tables, JSON file reading operations
with the help of read_csv(), read_tsv(), read_excel(), read_html(), json.loads()

# Readind CSV file without using Pandas's Functions, just using csv library
with the help of csv.reader()

# CSV file writing operations
with the help of to_csv(), sys.stdout()

# Reading and writing data to the file in to BINARY format
Pickle file, (.h5) format file

# -----------------------------------------------------------------------------------------

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# Remainng Part - 2
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@

# Writing data from DataFrame to csv file

In [3]:
pd.options.display.max_rows=5

In [4]:
db = pd.read_csv('All_data_files\\exe1.csv', nrows=2)
db

   a  b    c  d message
0  1  2  3.0  4   hello
1  5  6  NaN  8   world

In [5]:
db = pd.read_csv('All_data_files\\exe1.csv')
db

   a   b     c    d message
0  1   2   3.0  4.0   hello
1  5   6   NaN  8.0   world
2  9  10  11.0  NaN     foo

In [6]:
db.to_csv('All_data_files\\omkara.csv', sep=';')

In [8]:
k = pd.read_csv('All_data_files\\omkara.csv', sep=';')
k

   Unnamed: 0  a   b     c    d message
0           0  1   2   3.0  4.0   hello
1           1  5   6   NaN  8.0   world
2           2  9  10  11.0  NaN     foo

In [10]:
db.to_csv('All_data_files\\omkara.csv', sep=';', index=False, header=False)

In [11]:
k = pd.read_csv('All_data_files\\omkara.csv', sep=';')
k

   1   2   3.0  4.0  hello
0  5   6   NaN  8.0  world
1  9  10  11.0  NaN    foo

Write a specific columns into the csv file

In [12]:
db

   a   b     c    d message
0  1   2   3.0  4.0   hello
1  5   6   NaN  8.0   world
2  9  10  11.0  NaN     foo

In [14]:
db.to_csv('All_data_files\\omkara1.csv',sep='/', index=False, columns=['a','message'])

In [15]:
k = pd.read_csv('All_data_files\\omkara1.csv', sep='/')
k

   a message
0  1   hello
1  5   world
2  9     foo

In [16]:
db.to_csv('All_data_files\\omkara2.csv')

In [17]:
k = pd.read_csv('All_data_files\\omkara2.csv')
k

   Unnamed: 0  a   b     c    d message
0           0  1   2   3.0  4.0   hello
1           1  5   6   NaN  8.0   world
2           2  9  10  11.0  NaN     foo

# Reading JSON file
json.loads() library is used to convert string(which is compatible with JSON script) in to dictionry

In [18]:
import json as js

In [19]:
obj = """{
"name":"Wes",
"places_lived":["USA", "Spain", "Germany"],
"pet":null,
"siblings":[{"name":"Scott", "age":30, "pets":["Zeus","Zuko"]},
            {"name":"Katie", "age":38,
            "pets":["Sixes", "Stache", "Cisco"]}]
}"""

result = js.loads(obj)
result

{u'name': u'Wes',
 u'pet': None,
 u'places_lived': [u'USA', u'Spain', u'Germany'],
 u'siblings': [{u'age': 30, u'name': u'Scott', u'pets': [u'Zeus', u'Zuko']},
  {u'age': 38, u'name': u'Katie', u'pets': [u'Sixes', u'Stache', u'Cisco']}]}

In [20]:
result['siblings']

[{u'age': 30, u'name': u'Scott', u'pets': [u'Zeus', u'Zuko']},
 {u'age': 38, u'name': u'Katie', u'pets': [u'Sixes', u'Stache', u'Cisco']}]

Fetching perticular columns

In [21]:
import pandas as pd
json_part = pd.DataFrame(result['siblings'], columns=['name', 'age', 'pets'])
json_part

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [22]:
json_part = pd.DataFrame(result['siblings'], columns = ['age', 'pets'])
json_part

   age                    pets
0   30            [Zeus, Zuko]
1   38  [Sixes, Stache, Cisco]

In [23]:
json_part = pd.DataFrame(result['siblings'])
json_part

   age   name                    pets
0   30  Scott            [Zeus, Zuko]
1   38  Katie  [Sixes, Stache, Cisco]

In [24]:
strJson = """{
	"id": "0001",
	"type": "donut",
	"name": "Cake",
	"ppu": 0.55,
	"batters":
		{
			"batter":
				[
					{ "id": "1001", "type": "Regular" },
					{ "id": "1002", "type": "Chocolate" },
					{ "id": "1003", "type": "Blueberry" },
					{ "id": "1004", "type": "Devil's Food" }
				]
		},
	"topping":
		[
			{ "id": "5001", "type": "None" },
			{ "id": "5002", "type": "Glazed" },
			{ "id": "5005", "type": "Sugar" },
			{ "id": "5007", "type": "Powdered Sugar" },
			{ "id": "5006", "type": "Chocolate with Sprinkles" },
			{ "id": "5003", "type": "Chocolate" },
			{ "id": "5004", "type": "Maple" }
		]
}"""

json_object = js.loads(strJson)
print(type(strJson))
print(type(json_object))
json_object

<type 'str'>
<type 'dict'>

{u'batters': {u'batter': [{u'id': u'1001', u'type': u'Regular'},
   {u'id': u'1002', u'type': u'Chocolate'},
   {u'id': u'1003', u'type': u'Blueberry'},
   {u'id': u'1004', u'type': u"Devil's Food"}]},
 u'id': u'0001',
 u'name': u'Cake',
 u'ppu': 0.55,
 u'topping': [{u'id': u'5001', u'type': u'None'},
  {u'id': u'5002', u'type': u'Glazed'},
  {u'id': u'5005', u'type': u'Sugar'},
  {u'id': u'5007', u'type': u'Powdered Sugar'},
  {u'id': u'5006', u'type': u'Chocolate with Sprinkles'},
  {u'id': u'5003', u'type': u'Chocolate'},
  {u'id': u'5004', u'type': u'Maple'}],
 u'type': u'donut'}

json.dumps() is used to convert dictionary to string.

In [25]:
str1 = js.dumps(json_object)

In [26]:
print(type(json_object))
print(type(str1))

<type 'dict'>
<type 'str'>

# Calling data from example.json file

In [27]:
json_data = pd.read_json('All_data_files\\example.json')
json_data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# json data writing to the file operation

In [28]:
json_data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [29]:
json_data.to_json()  #By default System returns, there is no file name given

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [22]:
json_data.to_json(orient="records")   #By default System returns, there is no file name given

'[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]'

In [32]:
json_data.to_json('All_data_files\\gct.json', orient="records")

In [24]:
bankDF = pd.read_csv("All_data_files\\bank-additional-full.csv", sep=';', nrows=50,)
bankDF.columns

Index([u'age', u'job', u'marital', u'education', u'default', u'housing',
       u'loan', u'contact', u'month', u'day_of_week', u'duration', u'campaign',
       u'pdays', u'previous', u'poutcome', u'emp.var.rate', u'cons.price.idx',
       u'cons.conf.idx', u'euribor3m', u'nr.employed', u'y'],
      dtype='object')

In [25]:
bankDF.to_csv('All_data_files\\new_bank_data.csv', sep=',', index=None, columns=['age', 'job', 'marital', 'education'] )

IOError: [Errno 2] No such file or directory: 'All_files\\new_bank_data.csv'

In [35]:
bankDF1= pd.read_csv('All_data_files\\new_bank_data.csv')
bankDF1

    age          job  marital          education
0    56    housemaid  married           basic.4y
1    57     services  married        high.school
..  ...          ...      ...                ...
48   35       admin.  married  university.degree
49   45  blue-collar  married           basic.9y

[50 rows x 4 columns]

# ChunkSize=10000 operation on read_csv() function

In [36]:
db = pd.read_csv('All_data_files\\bank-additional-full.csv', sep=';', chunksize=2)

In [37]:
db.get_chunk(10)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8,24,technician,single,professional.course,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191,no
9,25,services,single,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191,no

In [38]:
#for c in db:
 #   print(c)

sys operations

In [39]:
import sys

In [40]:
db = pd.read_csv('All_data_files\\exe1.csv')
db

   a   b     c    d message
0  1   2   3.0  4.0   hello
1  5   6   NaN  8.0   world
2  9  10  11.0  NaN     foo

In [41]:
db.to_csv(sys.stdout, na_rep='NULL')

,a,b,c,d,message
0,1,2,3.0,4.0,hello
1,5,6,NULL,8.0,world
2,9,10,11.0,NULL,foo

In [42]:
db

   a   b     c    d message
0  1   2   3.0  4.0   hello
1  5   6   NaN  8.0   world
2  9  10  11.0  NaN     foo

# Reading CSV file without Pandas Functions

In [43]:
import csv

In [44]:
f = open('All_data_files\\exe1.csv','r')
read_csv = csv.reader(f)
print(f)
print(read_csv)
for line in read_csv:
    print line

<open file 'All_data_files\\exe1.csv', mode 'r' at 0x0000000008785D20>
<_csv.reader object at 0x000000000898BB28>
['a', 'b', 'c', 'd', 'message']
['1', '2', '3', '4', 'hello']
['5', '6', '', '8', 'world']
['9', '10', '11', '', 'foo']

Another way using csv library

In [45]:
with open('All_data_files\\exe1.csv') as ct:
    newLst = list(csv.reader(ct))
newLst

[['a', 'b', 'c', 'd', 'message'],
 ['1', '2', '3', '4', 'hello'],
 ['5', '6', '', '8', 'world'],
 ['9', '10', '11', '', 'foo']]

Assigning List values to the variables:

In [46]:
lst1, lst2, lst3 = newLst[0], newLst[0:2], newLst[1:]

In [47]:
print(lst1)
print(lst2)
print(lst3)

['a', 'b', 'c', 'd', 'message']
[['a', 'b', 'c', 'd', 'message'], ['1', '2', '3', '4', 'hello']]
[['1', '2', '3', '4', 'hello'], ['5', '6', '', '8', 'world'], ['9', '10', '11', '', 'foo']]

# Binary file format
writing pickle binary data

In [48]:
db = pd.read_csv('All_data_files\\exe1.csv')
db

   a   b     c    d message
0  1   2   3.0  4.0   hello
1  5   6   NaN  8.0   world
2  9  10  11.0  NaN     foo

In [49]:
db.to_pickle("All_data_files\\Pickle_from_csv")

In [50]:
data = pd.read_pickle('All_data_files\\Pickle_from_csv')
data

   a   b     c    d message
0  1   2   3.0  4.0   hello
1  5   6   NaN  8.0   world
2  9  10  11.0  NaN     foo

writing json data to pickle file

In [51]:
json_data = pd.read_json('All_data_files\\example.json')
json_data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [53]:
json_data.to_pickle("All_data_files\\Pickle_from_json")

In [54]:
db = pd.read_pickle("All_data_files\\Pickle_from_json")
db

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [55]:
pwd()

u'C:\\Users\\OMKARA\\Documents\\CT Patel'

writing (.h5) binary file

In [56]:
frame1 = pd.DataFrame({'a': np.random.randn(10)})
frame1

           a
0   1.163503
1  -1.515706
..       ...
8  -0.552278
9  -2.477040

[10 rows x 1 columns]

In [57]:
frame2 = pd.DataFrame({'b': np.random.randn(5)})
frame2

          b
0  0.216139
1  1.028157
2 -0.832723
3 -0.037491
4 -0.877184

In [63]:
store = pd.HDFStore("All_data_files\\Binary_h5_format.h5")

In [64]:
store['ct'] = frame1
store['kt'] = frame2

In [65]:
 store

<class 'pandas.io.pytables.HDFStore'>
File path: All_data_files\Binary_h5_format.h5

In [66]:
store['ct']

           a
0   1.163503
1  -1.515706
..       ...
8  -0.552278
9  -2.477040

[10 rows x 1 columns]

In [67]:
store['kt']

          b
0  0.216139
1  1.028157
2 -0.832723
3 -0.037491
4 -0.877184

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# Remainng Part - 3
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@